docs/chapter4/solution8.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2021-04-04 Sun 15:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Sibi Prabakaran">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://psibi.in/velleman-calculus/"> UP </a>
 |
 <a accesskey="H" href="https://psibi.in/"> HOME </a>
</div><div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Solution 1</a></li>
<li><a href="#sec-2">2. Solution 2</a></li>
<li><a href="#sec-3">3. Solution 3</a></li>
<li><a href="#sec-4">4. Solution 4</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Solution 1</h2>
<div class="outline-text-2" id="text-1">
<p>
\(\lim_{x \to 1} \dfrac{x^4 - 1}{x^5 - 1}\)
</p>

<p>
The above limit approaches \(0/0\), so we can probably apply L'Hopital's
rule to compute the limits.
</p>

<p>
Let's write some GNU Octave code to solve this further:
</p>

<div class="octave"><pre><span></span><span class="n">clear</span>
<span class="n">pkg</span> <span class="nb">load</span> <span class="n">symbolic</span>
<span class="n">syms</span> <span class="n">x</span>
<span class="n">f</span> <span class="p">=</span> <span class="p">(</span><span class="n">x</span>^<span class="mi">4</span> <span class="o">-</span> <span class="mi">1</span><span class="p">)</span>
<span class="n">df</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">f</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span>
<span class="n">g</span> <span class="p">=</span> <span class="n">x</span>^<span class="mi">5</span> <span class="o">-</span> <span class="mi">1</span>
<span class="n">dg</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">g</span><span class="p">,</span><span class="n">x</span><span class="p">)</span>
<span class="n">res</span> <span class="p">=</span> <span class="n">simplify</span><span class="p">(</span><span class="n">df</span> <span class="o">/</span> <span class="n">dg</span><span class="p">)</span>

<span class="n">res_h</span> <span class="p">=</span> <span class="n">function_handle</span><span class="p">(</span><span class="n">res</span><span class="p">)</span>
<span class="nb">rats</span><span class="p">(</span><span class="n">res_h</span><span class="p">(</span><span class="mi">1</span><span class="p">))</span>
</pre></div>

<div class="highlight"><pre><span></span>octave&gt; octave&gt; f = (sym)

   4
  x  - 1
df = (sym)

     3
  4⋅x
g = (sym)

   5
  x  - 1
dg = (sym)

     4
  5⋅x
res = (sym)

   4
  ───
  5⋅x
octave&gt; res_h =

@(x) 4 ./ (5 * x)
ans =       4/5
</pre></div>

<p>
So from L'Hopital's rule, we can conclude that \(\lim_{x \to 1}
\dfrac{x^4 - 1}{x^5 - 1} = \dfrac{4}{5}\)
</p>

<p>
We can also use GNU Octave to verify our limits:
</p>

<div class="octave"><pre><span></span><span class="n">clear</span>
<span class="n">syms</span> <span class="n">x</span>
<span class="n">L</span> <span class="p">=</span> <span class="n">limit</span><span class="p">((</span><span class="n">x</span>^<span class="mi">4</span> <span class="o">-</span> <span class="mi">1</span><span class="p">)</span><span class="o">/</span><span class="p">(</span><span class="n">x</span>^<span class="mi">5</span> <span class="o">-</span> <span class="mi">1</span><span class="p">),</span> <span class="n">x</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
</pre></div>

<pre class="example">
octave&gt; L = (sym) 4/5
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Solution 2</h2>
<div class="outline-text-2" id="text-2">
<p>
\(\lim_{x \to 1} \dfrac{\sqrt[4]{x} - 1}{\sqrt[5]{x} - 1}\)
</p>

<p>
The above limit approaches \(0/0\), so we can probably apply L'Hopital's
rule to compute the limits.
</p>

<p>
Let's write some GNU Octave code to solve this further:
</p>

<div class="octave"><pre><span></span><span class="n">clear</span>
<span class="n">pkg</span> <span class="nb">load</span> <span class="n">symbolic</span>
<span class="n">syms</span> <span class="n">x</span>
<span class="n">f</span> <span class="p">=</span> <span class="p">(</span><span class="n">x</span>^<span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">4</span><span class="p">)</span> <span class="o">-</span> <span class="mi">1</span><span class="p">)</span>
<span class="n">df</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">f</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span>

<span class="n">g</span> <span class="p">=</span> <span class="n">x</span>^<span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">5</span><span class="p">)</span> <span class="o">-</span> <span class="mi">1</span>
<span class="n">dg</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">g</span><span class="p">,</span><span class="n">x</span><span class="p">)</span>

<span class="n">res</span> <span class="p">=</span> <span class="n">simplify</span><span class="p">(</span><span class="n">df</span> <span class="o">/</span> <span class="n">dg</span><span class="p">)</span>

<span class="n">res_h</span> <span class="p">=</span> <span class="n">function_handle</span><span class="p">(</span><span class="n">res</span><span class="p">)</span>
<span class="nb">rats</span><span class="p">(</span><span class="n">res_h</span><span class="p">(</span><span class="mi">1</span><span class="p">))</span>
</pre></div>

<div class="highlight"><pre><span></span>octave&gt; octave&gt; warning: passing floating-point values to sym is dangerous, see &quot;help sym&quot;
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 379 column 13
    mpower at line 76 column 5
f = (sym)

  4 ___
  ╲╱ x  - 1
df = (sym)

    1
  ──────
     3/4
  4⋅x
octave&gt; warning: passing floating-point values to sym is dangerous, see &quot;help sym&quot;
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 379 column 13
    mpower at line 76 column 5
g = (sym)

  5 ___
  ╲╱ x  - 1
dg = (sym)

    1
  ──────
     4/5
  5⋅x
octave&gt; res = (sym)

    20___
  5⋅╲╱ x
  ───────
     4
octave&gt; res_h =

@(x) 5 * x .^ (1 / 20) / 4
ans =       5/4
</pre></div>

<p>
So from L'Hopital's rule, we can conclude that \(\lim_{x \to 1}
\dfrac{\sqrt[4]{x} - 1}{\sqrt[5]{x} - 1} = \dfrac{5}{4}\)
</p>

<p>
We can also use GNU Octave to verify our limits:
</p>

<div class="octave"><pre><span></span><span class="n">clear</span>
<span class="n">syms</span> <span class="n">x</span>
<span class="n">L</span> <span class="p">=</span> <span class="n">limit</span><span class="p">((</span><span class="n">x</span>^<span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">4</span><span class="p">)</span> <span class="o">-</span> <span class="mi">1</span><span class="p">)</span><span class="o">/</span><span class="p">(</span><span class="n">x</span>^<span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">5</span><span class="p">)</span> <span class="o">-</span> <span class="mi">1</span><span class="p">),</span> <span class="n">x</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
</pre></div>

<div class="highlight"><pre><span></span>octave&gt; warning: passing floating-point values to sym is dangerous, see &quot;help sym&quot;
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 379 column 13
    mpower at line 76 column 5
warning: passing floating-point values to sym is dangerous, see &quot;help sym&quot;
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 379 column 13
    mpower at line 76 column 5
L = (sym) 5/4
</pre></div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Solution 3</h2>
<div class="outline-text-2" id="text-3">
<p>
\(\lim_{u \to 4} \dfrac{u^{3/2}-8}{\sqrt{u}-2}\)
</p>

<p>
The above limit approaches \(0/0\), so we can probably apply L'Hopital's
rule to compute the limits.
</p>

<p>
Let's write some GNU Octave code to solve this further:
</p>

<div class="octave"><pre><span></span><span class="n">clear</span>
<span class="n">pkg</span> <span class="nb">load</span> <span class="n">symbolic</span>
<span class="n">syms</span> <span class="n">u</span>

<span class="n">f</span> <span class="p">=</span> <span class="n">u</span>^<span class="p">(</span><span class="mi">3</span><span class="o">/</span><span class="mi">2</span><span class="p">)</span> <span class="o">-</span> <span class="mi">8</span>
<span class="n">df</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">f</span><span class="p">,</span><span class="n">u</span><span class="p">)</span>

<span class="n">g</span> <span class="p">=</span> <span class="n">u</span>^<span class="p">(</span><span class="mi">1</span><span class="o">/</span><span class="mi">2</span><span class="p">)</span><span class="o">-</span><span class="mi">2</span>
<span class="n">dg</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">g</span><span class="p">,</span><span class="n">u</span><span class="p">)</span>

<span class="n">res</span> <span class="p">=</span> <span class="n">simplify</span><span class="p">(</span><span class="n">df</span><span class="o">/</span><span class="n">dg</span><span class="p">)</span>

<span class="n">res_h</span> <span class="p">=</span> <span class="n">function_handle</span><span class="p">(</span><span class="n">res</span><span class="p">)</span>
<span class="n">res_h</span><span class="p">(</span><span class="mi">4</span><span class="p">)</span>
</pre></div>

<div class="highlight"><pre><span></span>octave&gt; octave&gt; octave&gt; warning: passing floating-point values to sym is dangerous, see &quot;help sym&quot;
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 379 column 13
    mpower at line 76 column 5
f = (sym)

   3/2
  u    - 8
df = (sym)

  3⋅√u
  ────
   2
octave&gt; warning: passing floating-point values to sym is dangerous, see &quot;help sym&quot;
warning: called from
    double_to_sym_heuristic at line 50 column 7
    sym at line 379 column 13
    mpower at line 76 column 5
g = (sym) √u - 2
dg = (sym)

   1
  ────
  2⋅√u
octave&gt; res = (sym) 3⋅u
octave&gt; res_h =

@(u) 3 * u
ans =  12
</pre></div>

<p>
So from L'Hopital's rule, we can conclude that \(\lim_{u \to 4}
\dfrac{u^{3/2}-8}{\sqrt{u}-2} = 12\).
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Solution 4</h2>
<div class="outline-text-2" id="text-4">
<p>
\(\lim_{x \to 1} \dfrac{x^8 + 3x^6 - 5x^2 + 1}{x^7 + 4x^5 - 3x^3 - 2}\)
</p>

<div class="octave"><pre><span></span><span class="n">clear</span>
<span class="n">pkg</span> <span class="nb">load</span> <span class="n">symbolic</span>
<span class="n">syms</span> <span class="n">x</span>

<span class="n">f</span> <span class="p">=</span> <span class="n">x</span>^<span class="mi">8</span> <span class="o">+</span> <span class="p">(</span><span class="mi">3</span><span class="o">*</span><span class="n">x</span>^<span class="mi">6</span><span class="p">)</span> <span class="o">-</span> <span class="p">(</span><span class="mi">5</span><span class="o">*</span><span class="n">x</span>^<span class="mi">2</span><span class="p">)</span> <span class="o">+</span> <span class="mi">1</span>
<span class="n">fh</span> <span class="p">=</span> <span class="n">function_handle</span><span class="p">(</span><span class="n">f</span><span class="p">)</span>
<span class="n">fh</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>

<span class="n">g</span> <span class="p">=</span> <span class="n">x</span>^<span class="mi">7</span> <span class="o">+</span> <span class="p">(</span><span class="mi">4</span><span class="o">*</span><span class="n">x</span>^<span class="mi">5</span><span class="p">)</span> <span class="o">-</span> <span class="p">(</span><span class="mi">3</span><span class="o">*</span><span class="n">x</span>^<span class="mi">3</span><span class="p">)</span> <span class="o">-</span> <span class="mi">2</span>
<span class="n">gh</span> <span class="p">=</span> <span class="n">function_handle</span><span class="p">(</span><span class="n">g</span><span class="p">)</span>
<span class="n">gh</span><span class="p">(</span><span class="mi">1</span><span class="p">)</span>
</pre></div>

<div class="highlight"><pre><span></span>octave&gt; octave&gt; octave&gt; f = (sym)

   8      6      2
  x  + 3⋅x  - 5⋅x  + 1
fh =

@(x) x .^ 8 + 3 * x .^ 6 - 5 * x .^ 2 + 1
ans = 0
octave&gt; g = (sym)

   7      5      3
  x  + 4⋅x  - 3⋅x  - 2
gh =

@(x) x .^ 7 + 4 * x .^ 5 - 3 * x .^ 3 - 2
ans = 0
</pre></div>

<p>
The above limit approaches \(0/0\), so we can probably apply L'Hopital's
rule to compute the limits.
</p>

<p>
Let's write some GNU Octave code to solve this further:
</p>

<div class="octave"><pre><span></span><span class="n">df</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">f</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span>
<span class="n">dg</span> <span class="p">=</span> <span class="nb">diff</span><span class="p">(</span><span class="n">g</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span>

<span class="n">res</span> <span class="p">=</span> <span class="n">simplify</span><span class="p">(</span><span class="n">df</span><span class="o">/</span><span class="n">dg</span><span class="p">)</span>
<span class="n">res_h</span> <span class="p">=</span> <span class="n">function_handle</span><span class="p">(</span><span class="n">res</span><span class="p">)</span>
<span class="nb">rats</span><span class="p">(</span><span class="n">res_h</span><span class="p">(</span><span class="mi">1</span><span class="p">))</span>
</pre></div>

<div class="highlight"><pre><span></span>df = (sym)

     7       5
  8⋅x  + 18⋅x  - 10⋅x
dg = (sym)

     6       4      2
  7⋅x  + 20⋅x  - 9⋅x
octave&gt; res = (sym)

    ⎛   6      4    ⎞
  2⋅⎝4⋅x  + 9⋅x  - 5⎠
  ────────────────────
    ⎛   4       2    ⎞
  x⋅⎝7⋅x  + 20⋅x  - 9⎠
res_h =

@(x) 2 * (4 * x .^ 6 + 9 * x .^ 4 - 5) ./ (x .* (7 * x .^ 4 + 20 * x .^ 2 - 9))
ans =       8/9
</pre></div>

<p>
So from L'Hopital's rule, we can conclude that \(\lim_{x \to 1}
\dfrac{x^8 + 3x^6 - 5x^2 + 1}{x^7 + 4x^5 - 3x^3 - 2} = \dfrac{8}{9}\)
</p>

<p>
We can also use GNU Octave to verify our limits:
</p>

<div class="octave"><pre><span></span><span class="n">L</span> <span class="p">=</span> <span class="n">limit</span><span class="p">(</span><span class="n">f</span><span class="o">/</span><span class="n">g</span><span class="p">,</span> <span class="n">x</span><span class="p">,</span> <span class="mi">1</span><span class="p">)</span>
</pre></div>

<pre class="example">
L = (sym) 8/9
</pre>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Sibi Prabakaran</p>
<p class="date">Created: 2021-04-04 Sun 15:15</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="http://orgmode.org">Org-mode</a> 9.4)</p>
</div>
</footer>
</body>
</html>
